lesson-1.org
#+title:    Python Basics and Data Structures
#+author:   Alberto Valdez
#+email:    avq5ac1@gmail.com
#+SETUPFILE: https://albertov5.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: num:nil
#+PROPERTY: header-args :mkdirp yes :dir . :exports both
#+PROPERTY: header-args:shell :results drawer :wrap example :results silent
#+PROPERTY: header-args:python :exports both :results output replace

| [[./index.org][<<Back]] | [[./lesson-2.org][Lesson-2]] | [[./material.org][Material]] | [[./challenge/readme.org][Challenge>>]] |

These notes are taken during the class.

* Introduction

#+NAME: python_version
#+begin_src shell
python --version
#+end_src

#+CALL: python_version()

 1. Why a programming language?
 2. Why Python?
 3. Why Data?

 We will use Python for everything. From data collection, data cleaning to API connections, databases, ML, data visualization, etc.

 Python is easy to distribute, it can be compiled to use with other languages and it's easy to work with.

Recommendations:

 1. Take a lot of notes
 2. Check on Slack
 3. Put more hours into studying
 4. Make diagrams
 5. Look for extra resources

* Terminal commands

List of useful terminal commands:
#+begin_src shell :eval no
# See files in directory:
ls
# See all files (including hidden) in directory:
ls -a
# Move to another directory:
cd .
# Create a new directory.
mkdir example
# Create an empty file.
touch ./example/example.py
# Open a finder/explorer window in current directory.
open .
# Edit a file:
open example/example.py
# Edit file with editor:
code example/example.py
# Clear terminal clutter:
clear
#+end_src

* Python
** Variables
Declaring variables.
#+begin_src python
title = "doctor"
year = 2022
expert = True
print("Carlos is a " + title)
print("Current year is " + str(year))
print("Is Galo an expert? " + str(expert))
print(f"Current year is {year}, Carlos is a {title}. Is Galo an expert? {expert}")
#+end_src

#+RESULTS:
: Carlos is a doctor
: Current year is 2022
: Is Galo an expert? True
: Current year is 2022, Carlos is a doctor. Is Galo an expert? True

** Variables Activity
#+begin_src python
# Create a variable called 'name' that holds a string
name = "Alberto"
# Create a variable called 'country' that holds a string
country = "Mexico"
# Create a variable called 'age' that holds an integer
age = 27
# Create a variable called 'hourly_wage' that holds an integer
hourly_wage = 15
# Calculate the daily wage for the user
daily_wage = hourly_wage * 8
# Create a variable called 'satisfied' that holds a boolean
satisfied = True
# Print out "Hello <name>!"
print(f"Hello {name}!")
# Print out what country the user entered
print(f"{country}")
# Print out the user's age
print(f"{age}")
# With an f-string, print out the daily wage that was calculated
print(f"${daily_wage}")
# With an f-string, print out whether the users were satisfied
print(f"{satisfied}")
#+end_src

#+RESULTS:
: Hello Alberto!
: Mexico
: 27
: $120
: True

* Data Structures

