lesson-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-14 Thu 00:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python Basics and Data Structures</title>
<meta name="author" content="Alberto Valdez" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://albertov5.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://albertov5.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python Basics and Data Structures</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4744514">Introduction</a></li>
<li><a href="#orgb38f371">Terminal commands</a></li>
<li><a href="#orgb617f79">Python</a>
<ul>
<li><a href="#org9bc7a41">Variables</a></li>
<li><a href="#org98901ac">Variables Activity</a></li>
</ul>
</li>
<li><a href="#orgcd3219e">Data Structures</a>
<ul>
<li><a href="#org1daa7aa">Lists</a></li>
<li><a href="#orge7a580d">Tuples</a></li>
<li><a href="#org91ecb40">Activity - Groceries</a></li>
<li><a href="#org1ea8fad">Dictionaries</a></li>
<li><a href="#org4619d80">Activity - Pet Hobbies</a></li>
</ul>
</li>
<li><a href="#org54cc09a">Office hours</a>
<ul>
<li><a href="#orga2fadb0">When to use [] or {} or ()?</a></li>
<li><a href="#org5571091">What is Anaconda, IDLE, VS Code?</a></li>
<li><a href="#org21df61d">Can we use <code>my_list.index()</code> instead of accessing it with <code>[i]</code>?</a></li>
<li><a href="#org517aef1">Can we work with Python 3.10 or other version that is not 3.7?</a></li>
<li><a href="#orgd378929">How to know if we have Python installed?</a></li>
<li><a href="#orgf5c4c3f">Do we need to change directory for executing python code?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./index.html">&lt;&lt;Back</a></td>
<td class="org-left"><a href="./lesson-2.html">Lesson-2</a></td>
<td class="org-left"><a href="./material.html">Material</a></td>
<td class="org-left"><a href="./challenge/readme.html">Challenge&gt;&gt;</a></td>
</tr>
</tbody>
</table>

<p>
These notes are taken during the class.
</p>

<div id="outline-container-org4744514" class="outline-2">
<h2 id="org4744514">Introduction</h2>
<div class="outline-text-2" id="text-org4744514">
<div class="org-src-container">
<pre class="src src-shell" id="org53959a5">python --version
</pre>
</div>

<pre class="example" id="org2aa5921">
Python 3.7.13
</pre>

<ol class="org-ol">
<li>Why a programming language?</li>
<li>Why Python?</li>
<li>Why Data?</li>
</ol>

<p>
We will use Python for everything. From data collection, data cleaning to API connections, databases, ML, data visualization, etc.
</p>

<p>
Python is easy to distribute, it can be compiled to use with other languages and it&rsquo;s easy to work with.
</p>

<p>
Recommendations:
</p>

<ol class="org-ol">
<li>Take a lot of notes</li>
<li>Check on Slack</li>
<li>Put more hours into studying</li>
<li>Make diagrams</li>
<li>Look for extra resources</li>
</ol>
</div>
</div>

<div id="outline-container-orgb38f371" class="outline-2">
<h2 id="orgb38f371">Terminal commands</h2>
<div class="outline-text-2" id="text-orgb38f371">
<p>
List of useful terminal commands:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #559944;"># </span><span style="color: #559944;">See files in directory:</span>
<span style="color: #33CCAA;">ls</span>
<span style="color: #559944;"># </span><span style="color: #559944;">See all files (including hidden) in directory:</span>
<span style="color: #33CCAA;">ls</span> -a
<span style="color: #559944;"># </span><span style="color: #559944;">Move to another directory:</span>
<span style="color: #33CCAA;">cd</span> .
<span style="color: #559944;"># </span><span style="color: #559944;">Create a new directory.</span>
<span style="color: #33CCAA;">mkdir</span> example
<span style="color: #559944;"># </span><span style="color: #559944;">Create an empty file.</span>
<span style="color: #33CCAA;">touch</span> ./example/example.py
<span style="color: #559944;"># </span><span style="color: #559944;">Open a finder/explorer window in current directory.</span>
open .
<span style="color: #559944;"># </span><span style="color: #559944;">Edit a file:</span>
open example/example.py
<span style="color: #559944;"># </span><span style="color: #559944;">Edit file with editor:</span>
code example/example.py
<span style="color: #559944;"># </span><span style="color: #559944;">Clear terminal clutter:</span>
clear
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb617f79" class="outline-2">
<h2 id="orgb617f79">Python</h2>
<div class="outline-text-2" id="text-orgb617f79">
</div>
<div id="outline-container-org9bc7a41" class="outline-3">
<h3 id="org9bc7a41">Variables</h3>
<div class="outline-text-3" id="text-org9bc7a41">
<p>
Declaring variables.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">title</span> = <span style="color: #c5937c;">"doctor"</span>
<span style="color: #a9dbfa;">year</span> = <span style="color: #BBCCAA; font-weight: bold;">2022</span>
<span style="color: #a9dbfa;">expert</span> = <span style="color: #3399DD;">True</span>
<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Carlos is a "</span> + title)
<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Current year is "</span> + <span style="color: #CC88CC;">str</span>(year))
<span style="color: #CC88CC;">print</span>(<span style="color: #c5937c;">"Is Galo an expert? "</span> + <span style="color: #CC88CC;">str</span>(expert))
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"Current year is </span>{year}<span style="color: #c5937c;">, Carlos is a </span>{title}<span style="color: #c5937c;">. Is Galo an expert? </span>{expert}<span style="color: #c5937c;">"</span>)
</pre>
</div>

<pre class="example">
Carlos is a doctor
Current year is 2022
Is Galo an expert? True
Current year is 2022, Carlos is a doctor. Is Galo an expert? True
</pre>
</div>
</div>

<div id="outline-container-org98901ac" class="outline-3">
<h3 id="org98901ac">Variables Activity</h3>
<div class="outline-text-3" id="text-org98901ac">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #559944;"># </span><span style="color: #559944;">Create a variable called 'name' that holds a string</span>
<span style="color: #a9dbfa;">name</span> = <span style="color: #c5937c;">"Alberto"</span>
<span style="color: #559944;"># </span><span style="color: #559944;">Create a variable called 'country' that holds a string</span>
<span style="color: #a9dbfa;">country</span> = <span style="color: #c5937c;">"Mexico"</span>
<span style="color: #559944;"># </span><span style="color: #559944;">Create a variable called 'age' that holds an integer</span>
<span style="color: #a9dbfa;">age</span> = <span style="color: #BBCCAA; font-weight: bold;">27</span>
<span style="color: #559944;"># </span><span style="color: #559944;">Create a variable called 'hourly_wage' that holds an integer</span>
<span style="color: #a9dbfa;">hourly_wage</span> = <span style="color: #BBCCAA; font-weight: bold;">15</span>
<span style="color: #559944;"># </span><span style="color: #559944;">Calculate the daily wage for the user</span>
<span style="color: #a9dbfa;">daily_wage</span> = hourly_wage * <span style="color: #BBCCAA; font-weight: bold;">8</span>
<span style="color: #559944;"># </span><span style="color: #559944;">Create a variable called 'satisfied' that holds a boolean</span>
<span style="color: #a9dbfa;">satisfied</span> = <span style="color: #3399DD;">True</span>
<span style="color: #559944;"># </span><span style="color: #559944;">Print out "Hello &lt;name&gt;!"</span>
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"Hello </span>{name}<span style="color: #c5937c;">!"</span>)
<span style="color: #559944;"># </span><span style="color: #559944;">Print out what country the user entered</span>
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"</span>{country}<span style="color: #c5937c;">"</span>)
<span style="color: #559944;"># </span><span style="color: #559944;">Print out the user's age</span>
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"</span>{age}<span style="color: #c5937c;">"</span>)
<span style="color: #559944;"># </span><span style="color: #559944;">With an f-string, print out the daily wage that was calculated</span>
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"$</span>{daily_wage}<span style="color: #c5937c;">"</span>)
<span style="color: #559944;"># </span><span style="color: #559944;">With an f-string, print out whether the users were satisfied</span>
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"</span>{satisfied}<span style="color: #c5937c;">"</span>)
</pre>
</div>

<pre class="example">
Hello Alberto!
Mexico
27
$120
True
</pre>
</div>
</div>
</div>
