lesson-1.org
** Lists
Arrays, a way to organize data in a contiguous place. Lists can hold multiple data types, strings, integers, boolean, etc.
Lists in python are zero-based (index starts at zero).
#+begin_src python
# Creating a list
my_list = ["Jacob", 25, "Ahmed", 80]
print(f"My original list: {my_list}")
# Adding elements with =my_list.append()= or =my_list[]=
my_list.append("Matt")
my_list[3] = 85
print(f"My list with Matt: {my_list}")
# Removing elements in a list with my_list.pop()
my_list.pop(2)
print(f"My list without index 2: {my_list}")
# Getting index of an element with my_list.index()
jacob_index = my_list.index("Jacob")
print(f"Jacob's index: {jacob_index}")
# You can override elements with elements of differnt types
my_list[0] = True
print(f"My list's new index 0: {my_list[0]}")
# Get the length of a list with len(my_list)
print(f"Length of my list: {len(my_list)}")
#+end_src

#+RESULTS:
: My original list: ['Jacob', 25, 'Ahmed', 80]
: My list with Matt: ['Jacob', 25, 'Ahmed', 85, 'Matt']
: My list without index 2: ['Jacob', 25, 85, 'Matt']
: Jacob's index: 0
: My list's new index 0: True
: Length of my list: 4

** Tuples
Tuples are immutable lists (you can't modify them).
#+begin_src python
my_tuple = (0, 1, 2, 3, 4)
print(f"my_tuple is {my_tuple}")
# unpacking tuples
new_tuple = (my_tuple[0], my_tuple[3])
print(f"new_tuple is {new_tuple}")
#+end_src

#+RESULTS:
: my_tuple is (0, 1, 2, 3, 4)
: new_tuple is (0, 3)

** Activity - Groceries

#+begin_src python
# Create a Python list to store your grocery list
groceries = ["Milk", "Jelly", "Orange Juice","Peanut Butter"]
# Print the grocery list
print(groceries)
# Change "Peanut Butter" to "Almond Butter" and print out the updated list
groceries[groceries.index("Peanut Butter")] = "Almond Butter"
print(groceries)
# Remove "Jelly" from grocery list and print out the updated list
groceries.remove("Jelly")
print(groceries)
# Add "Coffee" to grocery list and print the updated list
groceries.append("Coffee")
print(groceries)
#+end_src

#+RESULTS:
: ['Milk', 'Jelly', 'Orange Juice', 'Peanut Butter']
: ['Milk', 'Jelly', 'Orange Juice', 'Almond Butter']
: ['Milk', 'Orange Juice', 'Almond Butter']
: ['Milk', 'Orange Juice', 'Almond Butter', 'Coffee']

** Dictionaries

A dictionary is a key, value pair collection of data.

The key must be a string (or an immutable variable) and the value can be whatever.
Example:
#+begin_src python
actors_list = ["Tom", "Angelina", "Kristen", "Denzel"]
actors_dict = {"name": "Tom", "lastname": "Cruise"}
# Accessing the dictionary:
print(f'{actors_dict["name"]}, {actors_dict["lastname"]}')
#+end_src

#+RESULTS:
: Tom, Cruise

A dictionary with many values.
#+begin_src python
another_actor = {
    "name": "Angelina Jolie",
    "genre": "Action",
    "married": False,
    "best_movies": ["Tomb Raider","Malefica"],
    "age": 50,
}
print(f"{another_actor['name']}")
#+end_src

#+RESULTS:
: Angelina Jolie
** Activity - Pet Hobbies

1. Create a dictionary to store the following:
   * Your pet's name
   * Your pet's age
   * A list of a few of your pet's hobbies
   * A dictionary of a few times you wake up during the week

2. Print out the following:
   * Your pet's name and age.
   * How many hobbies your pet has.
   * What your pet's favorite hobby is.
   * What time your pet wakes on one of the days of the week.

#+begin_src python
pet_info = {
    "name": "Zuri",
    "age": "16",
    "hobbies": ["sleeping", "eating", "peeing"],
    "wake_up": {
        "Mon": 7,
        "Friday": 11,
        "Saturday": 7,
        "Sunday": 5
    }
}
print(f"Hello I am {pet_info['name']} and I am {pet_info['age']} years old.")
print(f"I have {len(pet_info['hobbies'])} hobbies: {pet_info['hobbies']}.")
print(f"My favorite hobby is {pet_info['hobbies'][0]}.")
print(f"My wake up time on Monday is {pet_info['wake_up']['Mon']}:00 a.m.")
#+end_src

#+RESULTS:
: Hello I am Zuri and I am 16 years old.
: I have 3 hobbies: ['sleeping', 'eating', 'peeing'].
: My favorite hobby is sleeping.
: My wake up time on Monday is 7:00 a.m.


* Office hours

