lesson-1.html

<div id="outline-container-orgcd3219e" class="outline-2">
<h2 id="orgcd3219e">Data Structures</h2>
<div class="outline-text-2" id="text-orgcd3219e">
</div>
<div id="outline-container-org1daa7aa" class="outline-3">
<h3 id="org1daa7aa">Lists</h3>
<div class="outline-text-3" id="text-org1daa7aa">
<p>
Arrays, a way to organize data in a contiguous place. Lists can hold multiple data types, strings, integers, boolean, etc.
Lists in python are zero-based (index starts at zero).
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #559944;"># </span><span style="color: #559944;">Creating a list</span>
<span style="color: #a9dbfa;">my_list</span> = [<span style="color: #c5937c;">"Jacob"</span>, <span style="color: #BBCCAA; font-weight: bold;">25</span>, <span style="color: #c5937c;">"Ahmed"</span>, <span style="color: #BBCCAA; font-weight: bold;">80</span>]
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"My original list: </span>{my_list}<span style="color: #c5937c;">"</span>)
<span style="color: #559944;"># </span><span style="color: #559944;">Adding elements with =my_list.append()= or =my_list[]=</span>
my_list.append(<span style="color: #c5937c;">"Matt"</span>)
<span style="color: #a9dbfa;">my_list</span>[<span style="color: #BBCCAA; font-weight: bold;">3</span>] = <span style="color: #BBCCAA; font-weight: bold;">85</span>
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"My list with Matt: </span>{my_list}<span style="color: #c5937c;">"</span>)
<span style="color: #559944;"># </span><span style="color: #559944;">Removing elements in a list with my_list.pop()</span>
my_list.pop(<span style="color: #BBCCAA; font-weight: bold;">2</span>)
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"My list without index 2: </span>{my_list}<span style="color: #c5937c;">"</span>)
<span style="color: #559944;"># </span><span style="color: #559944;">Getting index of an element with my_list.index()</span>
jacob_index = my_list.index(<span style="color: #c5937c;">"Jacob"</span>)
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"Jacob's index: </span>{jacob_index}<span style="color: #c5937c;">"</span>)
<span style="color: #559944;"># </span><span style="color: #559944;">You can override elements with elements of differnt types</span>
my_list[<span style="color: #BBCCAA; font-weight: bold;">0</span>] = <span style="color: #3399DD;">True</span>
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"My list's new index 0: </span>{my_list[0]}<span style="color: #c5937c;">"</span>)
<span style="color: #559944;"># </span><span style="color: #559944;">Get the length of a list with len(my_list)</span>
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"Length of my list: </span>{<span style="color: #CC88CC;">len</span>(my_list)}<span style="color: #c5937c;">"</span>)
</pre>
</div>

<pre class="example">
My original list: ['Jacob', 25, 'Ahmed', 80]
My list with Matt: ['Jacob', 25, 'Ahmed', 85, 'Matt']
My list without index 2: ['Jacob', 25, 85, 'Matt']
Jacob's index: 0
My list's new index 0: True
Length of my list: 4
</pre>
</div>
</div>

<div id="outline-container-orge7a580d" class="outline-3">
<h3 id="orge7a580d">Tuples</h3>
<div class="outline-text-3" id="text-orge7a580d">
<p>
Tuples are immutable lists (you can&rsquo;t modify them).
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">my_tuple</span> = (<span style="color: #BBCCAA; font-weight: bold;">0</span>, <span style="color: #BBCCAA; font-weight: bold;">1</span>, <span style="color: #BBCCAA; font-weight: bold;">2</span>, <span style="color: #BBCCAA; font-weight: bold;">3</span>, <span style="color: #BBCCAA; font-weight: bold;">4</span>)
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"my_tuple is </span>{my_tuple}<span style="color: #c5937c;">"</span>)
<span style="color: #559944;"># </span><span style="color: #559944;">unpacking tuples</span>
<span style="color: #a9dbfa;">new_tuple</span> = (my_tuple[<span style="color: #BBCCAA; font-weight: bold;">0</span>], my_tuple[<span style="color: #BBCCAA; font-weight: bold;">3</span>])
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"new_tuple is </span>{new_tuple}<span style="color: #c5937c;">"</span>)
</pre>
</div>

<pre class="example">
my_tuple is (0, 1, 2, 3, 4)
new_tuple is (0, 3)
</pre>
</div>
</div>

<div id="outline-container-org91ecb40" class="outline-3">
<h3 id="org91ecb40">Activity - Groceries</h3>
<div class="outline-text-3" id="text-org91ecb40">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #559944;"># </span><span style="color: #559944;">Create a Python list to store your grocery list</span>
<span style="color: #a9dbfa;">groceries</span> = [<span style="color: #c5937c;">"Milk"</span>, <span style="color: #c5937c;">"Jelly"</span>, <span style="color: #c5937c;">"Orange Juice"</span>,<span style="color: #c5937c;">"Peanut Butter"</span>]
<span style="color: #559944;"># </span><span style="color: #559944;">Print the grocery list</span>
<span style="color: #CC88CC;">print</span>(groceries)
<span style="color: #559944;"># </span><span style="color: #559944;">Change "Peanut Butter" to "Almond Butter" and print out the updated list</span>
<span style="color: #a9dbfa;">groceries</span>[groceries.index(<span style="color: #c5937c;">"Peanut Butter"</span>)] = <span style="color: #c5937c;">"Almond Butter"</span>
<span style="color: #CC88CC;">print</span>(groceries)
<span style="color: #559944;"># </span><span style="color: #559944;">Remove "Jelly" from grocery list and print out the updated list</span>
groceries.remove(<span style="color: #c5937c;">"Jelly"</span>)
<span style="color: #CC88CC;">print</span>(groceries)
<span style="color: #559944;"># </span><span style="color: #559944;">Add "Coffee" to grocery list and print the updated list</span>
groceries.append(<span style="color: #c5937c;">"Coffee"</span>)
<span style="color: #CC88CC;">print</span>(groceries)
</pre>
</div>

<pre class="example">
['Milk', 'Jelly', 'Orange Juice', 'Peanut Butter']
['Milk', 'Jelly', 'Orange Juice', 'Almond Butter']
['Milk', 'Orange Juice', 'Almond Butter']
['Milk', 'Orange Juice', 'Almond Butter', 'Coffee']
</pre>
</div>
</div>

<div id="outline-container-org1ea8fad" class="outline-3">
<h3 id="org1ea8fad">Dictionaries</h3>
<div class="outline-text-3" id="text-org1ea8fad">
<p>
A dictionary is a key, value pair collection of data.
</p>

<p>
The key must be a string (or an immutable variable) and the value can be whatever.
Example:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">actors_list</span> = [<span style="color: #c5937c;">"Tom"</span>, <span style="color: #c5937c;">"Angelina"</span>, <span style="color: #c5937c;">"Kristen"</span>, <span style="color: #c5937c;">"Denzel"</span>]
<span style="color: #a9dbfa;">actors_dict</span> = {<span style="color: #c5937c;">"name"</span>: <span style="color: #c5937c;">"Tom"</span>, <span style="color: #c5937c;">"lastname"</span>: <span style="color: #c5937c;">"Cruise"</span>}
<span style="color: #559944;"># </span><span style="color: #559944;">Accessing the dictionary:</span>
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">'</span>{actors_dict["name"]}<span style="color: #c5937c;">, </span>{actors_dict["lastname"]}<span style="color: #c5937c;">'</span>)
</pre>
</div>

<pre class="example">
Tom, Cruise
</pre>


<p>
A dictionary with many values.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">another_actor</span> = {
    <span style="color: #c5937c;">"name"</span>: <span style="color: #c5937c;">"Angelina Jolie"</span>,
    <span style="color: #c5937c;">"genre"</span>: <span style="color: #c5937c;">"Action"</span>,
    <span style="color: #c5937c;">"married"</span>: <span style="color: #3399DD;">False</span>,
    <span style="color: #c5937c;">"best_movies"</span>: [<span style="color: #c5937c;">"Tomb Raider"</span>,<span style="color: #c5937c;">"Malefica"</span>],
    <span style="color: #c5937c;">"age"</span>: <span style="color: #BBCCAA; font-weight: bold;">50</span>,
}
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"</span>{another_actor['name']}<span style="color: #c5937c;">"</span>)
</pre>
</div>

<pre class="example">
Angelina Jolie
</pre>
</div>
</div>
<div id="outline-container-org4619d80" class="outline-3">
<h3 id="org4619d80">Activity - Pet Hobbies</h3>
<div class="outline-text-3" id="text-org4619d80">
<ol class="org-ol">
<li>Create a dictionary to store the following:
<ul class="org-ul">
<li>Your pet&rsquo;s name</li>
<li>Your pet&rsquo;s age</li>
<li>A list of a few of your pet&rsquo;s hobbies</li>
<li>A dictionary of a few times you wake up during the week</li>
</ul></li>

<li>Print out the following:
<ul class="org-ul">
<li>Your pet&rsquo;s name and age.</li>
<li>How many hobbies your pet has.</li>
<li>What your pet&rsquo;s favorite hobby is.</li>
<li>What time your pet wakes on one of the days of the week.</li>
</ul></li>
</ol>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a9dbfa;">pet_info</span> = {
    <span style="color: #c5937c;">"name"</span>: <span style="color: #c5937c;">"Zuri"</span>,
    <span style="color: #c5937c;">"age"</span>: <span style="color: #c5937c;">"16"</span>,
    <span style="color: #c5937c;">"hobbies"</span>: [<span style="color: #c5937c;">"sleeping"</span>, <span style="color: #c5937c;">"eating"</span>, <span style="color: #c5937c;">"peeing"</span>],
    <span style="color: #c5937c;">"wake_up"</span>: {
        <span style="color: #c5937c;">"Mon"</span>: <span style="color: #BBCCAA; font-weight: bold;">7</span>,
        <span style="color: #c5937c;">"Friday"</span>: <span style="color: #BBCCAA; font-weight: bold;">11</span>,
        <span style="color: #c5937c;">"Saturday"</span>: <span style="color: #BBCCAA; font-weight: bold;">7</span>,
        <span style="color: #c5937c;">"Sunday"</span>: <span style="color: #BBCCAA; font-weight: bold;">5</span>
    }
}
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"Hello I am </span>{pet_info['name']}<span style="color: #c5937c;"> and I am </span>{pet_info['age']}<span style="color: #c5937c;"> years old."</span>)
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"I have </span>{<span style="color: #CC88CC;">len</span>(pet_info['hobbies'])}<span style="color: #c5937c;"> hobbies: </span>{pet_info['hobbies']}<span style="color: #c5937c;">."</span>)
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"My favorite hobby is </span>{pet_info['hobbies'][0]}<span style="color: #c5937c;">."</span>)
<span style="color: #CC88CC;">print</span>(f<span style="color: #c5937c;">"My wake up time on Monday is </span>{pet_info['wake_up']['Mon']}<span style="color: #c5937c;">:00 a.m."</span>)
</pre>
</div>

<pre class="example">
Hello I am Zuri and I am 16 years old.
I have 3 hobbies: ['sleeping', 'eating', 'peeing'].
My favorite hobby is sleeping.
My wake up time on Monday is 7:00 a.m.
</pre>
</div>
</div>
</div>
