lesson-1.org
** When to use [] or {} or ()?
- [] for accessing a dictionary key or a list index.
- {} for creating a dictionary or in f-strings.
- () for using a function.
#+begin_src python
# creating and accessing lists
my_list = ["a", "b", "c", "d"]
print(my_list[0])
# creating and accessing dictionaries
my_dictionary = {"r":0.0, "g": 0.0, "b": 1.0, "a": 1.0}
print(my_dictionary["a"])
# using function to get info of data structures/variables
my_list_length = len(my_list)
print(my_list_length)
#+end_src

#+RESULTS:
: a
: 1.0
: 4

** What is Anaconda, IDLE, VS Code?
They are different ways to work with python code. Anaconda is an environment manager and package manager, IDLE is an editor and VS Code is a very powerful editor that can become an Integrated Development Environment when using extensions.
** Can we use =my_list.index()= instead of accessing it with =[i]=?
Yes.
** Can we work with Python 3.10 or other version that is not 3.7?
We can work with any version of Python out of the box but the problems raise whenever we work with libraries. Some versions have very different syntax like [[https://docs.python.org/3/whatsnew/3.6.html#whatsnew36-pep498][f-strings in version 3.6.]]
** How to know if we have Python installed?
There is no "Python app". You can know what version you have installed using: =python --version= or =py --version= in the terminal.
** Do we need to change directory for executing python code?
Depends if we are in a workspace. A workspace is a folder with all the files we are using in a project/app/library, etc.
- If we are in a workspace, VS Code will open a terminal in that workspace's folder.
- If we are just editing single files, VS Code will open a terminal in the home directory.
If we use =right-click=>run python file from terminal= in VS Code it will adapt to the location of the file.
For example, running a file directly in the working directory:
=python HelloVariableWorld.py=
Running a file from another directory:
=python /Users/albertovaldez/tec-data/week-3/lesson-1/3-1-Student-Resources/03-Stu_HelloVariableWorld/Unsolved/HelloVariableWorld.py=

Credit to Naomi for the Office Hours responses.
