lesson-1.html


<div id="outline-container-org54cc09a" class="outline-2">
<h2 id="org54cc09a">Office hours</h2>
<div class="outline-text-2" id="text-org54cc09a">
</div>
<div id="outline-container-orga2fadb0" class="outline-3">
<h3 id="orga2fadb0">When to use [] or {} or ()?</h3>
<div class="outline-text-3" id="text-orga2fadb0">
<ul class="org-ul">
<li>[] for accessing a dictionary key or a list index.</li>
<li>{} for creating a dictionary or in f-strings.</li>
<li>() for using a function.</li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #559944;"># </span><span style="color: #559944;">creating and accessing lists</span>
<span style="color: #a9dbfa;">my_list</span> = [<span style="color: #c5937c;">"a"</span>, <span style="color: #c5937c;">"b"</span>, <span style="color: #c5937c;">"c"</span>, <span style="color: #c5937c;">"d"</span>]
<span style="color: #CC88CC;">print</span>(my_list[<span style="color: #BBCCAA; font-weight: bold;">0</span>])
<span style="color: #559944;"># </span><span style="color: #559944;">creating and accessing dictionaries</span>
<span style="color: #a9dbfa;">my_dictionary</span> = {<span style="color: #c5937c;">"r"</span>:<span style="color: #BBCCAA; font-weight: bold;">0.0</span>, <span style="color: #c5937c;">"g"</span>: <span style="color: #BBCCAA; font-weight: bold;">0.0</span>, <span style="color: #c5937c;">"b"</span>: <span style="color: #BBCCAA; font-weight: bold;">1.0</span>, <span style="color: #c5937c;">"a"</span>: <span style="color: #BBCCAA; font-weight: bold;">1.0</span>}
<span style="color: #CC88CC;">print</span>(my_dictionary[<span style="color: #c5937c;">"a"</span>])
<span style="color: #559944;"># </span><span style="color: #559944;">using function to get info of data structures/variables</span>
<span style="color: #a9dbfa;">my_list_length</span> = <span style="color: #CC88CC;">len</span>(my_list)
<span style="color: #CC88CC;">print</span>(my_list_length)
</pre>
</div>

<pre class="example">
a
1.0
4
</pre>
</div>
</div>

<div id="outline-container-org5571091" class="outline-3">
<h3 id="org5571091">What is Anaconda, IDLE, VS Code?</h3>
<div class="outline-text-3" id="text-org5571091">
<p>
They are different ways to work with python code. Anaconda is an environment manager and package manager, IDLE is an editor and VS Code is a very powerful editor that can become an Integrated Development Environment when using extensions.
</p>
</div>
</div>
<div id="outline-container-org21df61d" class="outline-3">
<h3 id="org21df61d">Can we use <code>my_list.index()</code> instead of accessing it with <code>[i]</code>?</h3>
<div class="outline-text-3" id="text-org21df61d">
<p>
Yes.
</p>
</div>
</div>
<div id="outline-container-org517aef1" class="outline-3">
<h3 id="org517aef1">Can we work with Python 3.10 or other version that is not 3.7?</h3>
<div class="outline-text-3" id="text-org517aef1">
<p>
We can work with any version of Python out of the box but the problems raise whenever we work with libraries. Some versions have very different syntax like <a href="https://docs.python.org/3/whatsnew/3.6.html#whatsnew36-pep498">f-strings in version 3.6.</a>
</p>
</div>
</div>
<div id="outline-container-orgd378929" class="outline-3">
<h3 id="orgd378929">How to know if we have Python installed?</h3>
<div class="outline-text-3" id="text-orgd378929">
<p>
There is no &ldquo;Python app&rdquo;. You can know what version you have installed using: <code>python --version</code> or <code>py --version</code> in the terminal.
</p>
</div>
</div>
<div id="outline-container-orgf5c4c3f" class="outline-3">
<h3 id="orgf5c4c3f">Do we need to change directory for executing python code?</h3>
<div class="outline-text-3" id="text-orgf5c4c3f">
<p>
Depends if we are in a workspace. A workspace is a folder with all the files we are using in a project/app/library, etc.
</p>
<ul class="org-ul">
<li>If we are in a workspace, VS Code will open a terminal in that workspace&rsquo;s folder.</li>
<li>If we are just editing single files, VS Code will open a terminal in the home directory.</li>
</ul>
<p>
If we use <code>right-click=&gt;run python file from terminal</code> in VS Code it will adapt to the location of the file.
For example, running a file directly in the working directory:
<code>python HelloVariableWorld.py</code>
Running a file from another directory:
<code>python /Users/albertovaldez/tec-data/week-3/lesson-1/3-1-Student-Resources/03-Stu_HelloVariableWorld/Unsolved/HelloVariableWorld.py</code>
</p>

<p>
Credit to Naomi for the Office Hours responses.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alberto Valdez</p>
<p class="date">Created: 2022-07-14 Thu 00:24</p>
</div>
</body>
</html>
